app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 2], ["body", "bjhkbjk"], ["user_id", 1], ["created_at", "2019-07-02 16:48:47.702818"], ["updated_at", "2019-07-02 16:48:47.702818"]]