app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("elevation", "location", "distance", "level", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "elevation" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["elevation", "1000"], ["updated_at", "2019-07-02 06:36:25.021657"], ["id", 2]]

  def upvote
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def downvote
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]